docs/hello.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-Jul-15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hello</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Veera Sivarajan">
<link rel="stylesheet" type="text/css" href="/css/style.css"/>
</head>
<body>
<header id="top" class="status">
<nav>
  <a href="https://github.com/veera-sivarajan">Github</a>
  <a href="/">Home</a>
  <a href="/about/">About</a>
  <a href="mailto:sveera.2001@gmail.com">Email</a>
</nav>  
</header>
<main id="content">
<header>
<h1 class="title">Hello</h1>
<p class="subtitle">2021-Mar-06</p>
</header><p>
After several failed attempts to create a blog, I finally managed to make one by writing a static site generator in Bash based on nerdypepper&rsquo;s <a href="https://peppe.rs/posts/static_sites_with_bash/">post</a>. To put it simply, the Bash script reads all markdown files from a directory, converts them into HTML using <a href="https://pandoc.org/installing.html">Pandoc</a>, adds some essential CSS and HTML to all the files and writes all resulting files in a specific directory. I also wrote a small script to add a random <a href="https://en.wikipedia.org/wiki/Tirukku%E1%B9%9Fa%E1%B8%B7">Tirukkural</a> to my homepage whenever I update the blog. This script uses <a href="https://stedolan.github.io/jq/">jq</a> to fetch a kural from a JSON database on my system. Finally, to update the blog, all I have to do is execute <a href="https://github.com/veera-sivarajan/veera-sivarajan.github.io/blob/master/build.sh">build.sh</a> and push all files to remote. 
</p>

<p>
I stole the CSS from <a href="https://ambrevar.xyz/">here</a>. If you are the author of that blog, a big thank you and also I really appreciate your posts about Emacs.
</p>

<p>
I look forward to writing regulary on this blog.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Last updated on 2021-Jul-15 Thu 00:29. <br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.4.6). <br>
</div>
</footer>
</body>
</html>
